package chap06.exam.mal;

public class mal {
/*
 * 6-8
 * 클래스 변수(static)
 * 	int width, int height
 * 
 * 인스턴스 변수
 * int k , int n 
 * 
 * 지역 변수
 *  int kind, int num
 * 
 * --------------------------
 * 
 * 6-9
 * hp 
 * 
 * -------------------------
 * 6-10
 * c -> 기본 생성자같은경우는 생략가능해서 없을수도있음
 * e -> 생성자 , 메소드 오버로딩 ㅇㅇ
 *  
 * --------------------------
 * 
 * 6-11
 * d - > 내에서 사용하는것
 * 
 * --------------------------
 * 
 * 6-12
 * 
 * 오버로딩 성립 -> 이름이 같고 매개변수의 순서, 타입, 수가 달라야함. 리턴타입은 무관
 * c -> 리턴타입무관
 * d -> 매개변수의 이름이 다른건 상관없음.
 * ------------------------
 * 
 * 6-13
 * long add(int a, int b) { return a+b;}
 * a -> 매개변수이름만 다름 (X)
 * 
 * -------------------------
 * 
 * 6-14
 * 
 * c-> 순서는 모르겠음.
 * 
 * ----------------------
 * 
 * 6-15 
 * 기본값 -> 명시적(입력) -> 생성자 -> 초기화블럭?
 * ------------------------
 * 
 * 6-16
 * c-> 인스턴트변수
 * ---------------------
 * 6-17
 * cd
 * --------------------
 * 6-18
 * 
 * --------------
 * 
 *6-19
 *ABC123
 *ABC123
 *
 *6-20
 *
 *
 *
 *
 *
 *
 *
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
}
