//	조건문 : 어떤 조건에 따라서 다르게 실행을 하고자 할 떄
//	종류 : if문, swich문, 	
//	반복문 : 어떤 실행문을 반복 실행할때 사용
//	ex) 1~10 까지의 숫자의 합 , 반평균, 과목별 총점 평균 석차 등
//	종류 : for문, while문 , do-while문
//	어느방법으로 하던지 관계가 없습니다. 특정한 방법으로 해야된다는 제약이 없음.
// 	그렇지만 
//	for문 : 일정한 횟수를 반복실행할 때 유용하다.
//	while문 : 무한반복 , 어떤 조건에서 종료를 할 경우
//	do-while문 : 무조건 실행문이 수행이되고, 그 다음에 반복조건을 판단하여 계속여부를 결정할 떄.

//	break문, continue문 : 반복문과 같이 사용.
//	break문 : 나를 감싸는 반복문을 벗어나고자 할 때 사용, 보통은 어떤 조건에 만족할 때 동작을 하는 것이 일반적
//	continue문 : 어떤 조건에서 이후의 실행문을 수행하지 않고 다음 조건식으로 이동해서 계속 반복을 하고자 할 때
//	goto문 : 어떤 특정한 라벨(프로그램의 주소-위치)로 이동할 수 있음. -> 일반적으로 잘 사용하지않음. 이유) 프로그램의 흐름을 예측하기가 어렵다.

package chap04;

public class Introduction {

	public static void main(String[] args) {
		
		
	}

}
